cedriclako/C-1421-carte-controle/ESP32-Remote-Prototype/sbi-iot-server/main/webserver/OTAUploadSTM32.c
#include "OTAUploadSTM32.h"
#include "hardwaregpio.h"
#include "stm32-process.h"
#include "stm32-protocol.h"
#include "../fwconfig.h"
#include "../uartbridge/stovemb.h"
#include "../uartbridge/uartbridge.h"

#define TAG "OTAUploadSTM32"

esp_err_t OTAUPLOADSTM32_postotauploadSTM32_handler(httpd_req_t *req)
{
    esp_err_t err = ESP_FAIL;
    CHECK_FOR_ACCESS_OR_RETURN();

    const char* szError = NULL;

    FILE* flash_file = NULL;

    httpd_resp_set_type(req, "application/json");
    const char* filename = FWCONFIG_SPIFF_ROOTPATH"/stm32.bin";

    ESP_LOGI(TAG, "file_postotauploadSTM32_handler / uri: %s, filename: %s", req->uri, filename);

    // Stop the UART bridge
    UARTBRIDGE_SetSilenceMode(true);

    // Prepare the STM32
    flash_file = fopen(filename, "w");
    if (flash_file == NULL)
    {
        szError = "Unable to open file for writing operation";
        goto ERROR;
    }

    int binary_file_length = 0;
    int n = 0;
    
    do
    {
        n = httpd_req_recv(req, (char*)g_u8Buffers, HTTPSERVER_BUFFERSIZE);
        if (n == 0) {
            break;
        }
        else if (n < 0) {
            /* Respond with 500 Internal Server Error */
            szError = "Failed to receive";
            goto ERROR;
        }
        fwrite (g_u8Buffers , sizeof(uint8_t), n, flash_file);
        ESP_LOGI(TAG, "file_postotauploadSTM32_handler / receiving: %d bytes", n);

        binary_file_length += n;
    }
    while (n > 0);

    // Initialize upload
    STM32PROTOCOL_SContext sContext;
    STM32PROTOCOL_SConfig sConfig = STM32PROTOCOL_SCONFIG_INIT;
    sConfig.bInitGPIO = true;
    sConfig.reset_pin = HWGPIO_STM32_RESET_PIN;
    sConfig.boot0_pin = HWGPIO_STM32_BOOT0_PIN;
    sConfig.boot1_pin = HWGPIO_STM32_BOOT1_PIN;

    sConfig.uart_port = HWGPIO_BRIDGEUART_PORT_NUM;

    STM32PROTOCOL_Init(&sContext, &sConfig);

    if (STM32PROCESS_FlashSTM(&sContext, filename) != ESP_OK)
    {
        szError = "Unable to flash";
        goto ERROR;
    }

    httpd_resp_send(req, NULL, 0);
    err = ESP_OK;
    goto END;
    ERROR:
    err = ESP_FAIL;
    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, ((szError != NULL) ? szError : "Unknown error"));
    END:
    if (flash_file != NULL)
        fclose(flash_file);

    httpd_resp_set_hdr(req, "Connection", "close");
    // Restore the UART bridge.
    UARTBRIDGE_SetSilenceMode(false);
    return err;
}
